"use client";

import { useEffect, useState } from "react";
import { PageLoader } from "@/components/ui/PageLoader";

export default function ClientLayout({
  children,
}: {
  children: React.ReactNode;
}) {
  const [loading, setLoading] = useState(true);

  useEffect(() => {
    console.log(`
      ███╗   ██╗ ██████╗ ███╗   ███╗ █████╗ ██████╗ ██╗ ██████╗ █████╗
      ████╗  ██║██╔═══██╗████╗ ████║██╔══██╗██╔══██╗██║██╔════╝██╔══██╗
      ██╔██╗ ██║██║   ██║██╔████╔██║███████║██║  ██║██║██║     ███████║
      ██║╚██╗██║██║   ██║██║╚██╔╝██║██╔══██║██║  ██║██║██║     ██╔══██║
      ██║ ╚████║╚██████╔╝██║ ╚═╝ ██║██║  ██║██████╔╝██║╚██████╗██║  ██║
      ╚═╝  ╚═══╝ ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝╚═════╝ ╚═╝ ╚═════╝╚═╝  ╚═╝
`);
    const timer = setTimeout(() => setLoading(false), 2800);
    return () => clearTimeout(timer);
  }, []);

  return (
    <>
      {loading && <PageLoader />}

      <div
        style={{
          opacity: loading ? 0 : 1,
          transition: "opacity 0.5s ease",
        }}
      >
        {children}
      </div>
    </>
  );
}